In [1]:
import pandas as pd

### Series

In [ ]:
# to create a series we can convert list/tuple

In [2]:
sr1 = pd.Series([10,20,30,40,50])
sr1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
type(sr1)

pandas.core.series.Series

In [4]:
sr1[2]

30

In [5]:
sr2 = pd.Series([10,20,30,40,50] , index = ['a','b','c','d','e'], dtype = float)
sr2

a    10.0
b    20.0
c    30.0
d    40.0
e    50.0
dtype: float64

#### DataFrame

In [ ]:
# 2D data ( rows and columns )

In [6]:
dict1 = {
    'col1': pd.Series([10,20,30,40,50]),
    'col2': ('a','b','c','d','e')}
df1 = pd.DataFrame(dict1)
df1

   col1 col2
0    10    a
1    20    b
2    30    c
3    40    d
4    50    e

In [8]:
df1.dtypes
# int64 --> numeric 
# object --> string

col1     int64
col2    object
dtype: object

#### Merge
Combine two data frames ( equivalent to SQL join )

In [9]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [90,94,95,98,92]})
df2 = pd.DataFrame({'id': [3,4,5,6,7], 'ml_marks': [89,92,91,89,96]})
df2

   id  ml_marks
0   3        89
1   4        92
2   5        91
3   6        89
4   7        96

In [10]:
df1.merge(df2, on = 'id', how = 'inner')

   id  stat_marks  ml_marks
0   3          95        89
1   4          98        92
2   5          92        91

In [11]:
df1 = pd.DataFrame({'id': [1,2,3,4,5],'stat_marks': [90,94,95,98,92]})
df2 = pd.DataFrame({'id': [3,4,5,6,7],'stat_marks': [95,98,92,88,82]})
df2

   id  stat_marks
0   3          95
1   4          98
2   5          92
3   6          88
4   7          82

In [12]:
df1.merge(df2,on = 'id',how = 'inner')

   id  stat_marks_x  stat_marks_y
0   3            95            95
1   4            98            98
2   5            92            92

In [ ]:
# if you have different column names in both df1( pkey : id) and df2(pkey: sno)
# df1.merge(df2, left_on = 'id', right_on = 'sno', how = 'inner')

# if you want to join data frame on multiple columnsdf1( id,school ) and df2(pkey: sno,school)
# df1.merge(df2, left_on = ['id','school'], right_on = ['sno','school'], how = 'inner')
# select * df1 join df2 on df1.id = df2.sno and df1.school = df2.school ( equivalent sql code )

### Concat

In [15]:
df1 = pd.DataFrame({'id': [1,2,3,4,5],'stat_marks': [90,94,95,98,92]})
df2 = pd.DataFrame({'id': [6,7,8,9,10],'stat_marks': [95,98,92,88,82]})

pd.concat([df1,df2])

   id  stat_marks
0   1          90
1   2          94
2   3          95
3   4          98
4   5          92
0   6          95
1   7          98
2   8          92
3   9          88
4  10          82

In [16]:
df1 = pd.DataFrame({'id': [1,2,3,4,5],'stat_marks': [90,94,95,98,92]})
df2 = pd.DataFrame({'id': [6,7,8,9,10],'ml_marks': [95,98,92,88,82]})

pd.concat([df1,df2])

   id  stat_marks  ml_marks
0   1        90.0       NaN
1   2        94.0       NaN
2   3        95.0       NaN
3   4        98.0       NaN
4   5        92.0       NaN
0   6         NaN      95.0
1   7         NaN      98.0
2   8         NaN      92.0
3   9         NaN      88.0
4  10         NaN      82.0

In [ ]:
# df3 = pd.concat([df1,df2])
# df3.drop_duplicates(keep = False) # keep = false --> it will remove all duplicates

In [18]:
df1 = pd.DataFrame({'id': [1,2,3,4,5],'stat_marks': [90,94,95,98,92]})
df2 = pd.DataFrame({'id': [3,4,5,6,7],'stat_marks': [95,98,92,88,82]})

pd.concat([df1,df2]).drop_duplicates(keep = False) # keep = false --> it will remove all duplicates
# keep = first --> out of two duplicates it will keep first row
# keep = last --> it will keep last appearance

   id  stat_marks
0   1          90
1   2          94
3   6          88
4   7          82

### Join

In [19]:
df1 = pd.DataFrame({'id': [1,2,3,4,5],'stat_marks': [90,94,95,98,92]})
df2 = pd.DataFrame({'id': [6,7,3,4,5],'ml_marks': [95,98,92,88,82]})
# perform the join operation based on index values
df1.join(df2,lsuffix = '_df1', rsuffix = '_df2') # suffix parameters should be used when you have same column name in both df's

   id_df1  stat_marks  id_df2  ml_marks
0       1          90       6        95
1       2          94       7        98
2       3          95       3        92
3       4          98       4        88
4       5          92       5        82